src/test/resources/test-data/UploadItemsRequest.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"><soap:Header><t:RequestServerVersion Version="Exchange2013"></t:RequestServerVersion></soap:Header><soap:Body><m:UploadItems><m:Items><t:Item CreateAction="CreateNew"><t:ParentFolderId Id="1234"></t:ParentFolderId><t:Data>REFUQQ==</t:Data></t:Item><t:Item CreateAction="Update"><t:ParentFolderId Id="2345"></t:ParentFolderId><t:ItemId Id="3456"></t:ItemId><t:Data>REFUQQ==</t:Data></t:Item></m:Items></m:UploadItems></soap:Body></soap:Envelope>